/**
 * 登录类型：1-账号名密码 2-手机号 3-微信公众号授权 4-小程序授权 5-微信unionid登录
 */
export enum LOGIN_TYPE {
  账号名密码登录 = 1,
  手机号验证码 = 2,
  微信公众号授权 = 3,
  小程序授权 = 4,
  微信unionid登录 = 5,
}

/**
 * 角色类型 1-平台端 2-商家端 3-小程序端
 */
export enum ROLE_TYPE {
  平台端 = 1,
  商家端 = 2,
  小程序端 = 3,
}

/**
 * 权限类型 1-菜单 2-按钮
 */
export enum RIGHT_TYPE {
  菜单 = 1,
  按钮 = 2,
}

/**
 * 验证码类型
 */
export enum SMS_TYPE {
  验证码 = '验证码',
  通用 = '通用',
}

/**
 * 短信渠道
 */
export enum SMS_CHHANEL {
  阿里云 = '阿里云',
  腾讯云 = '腾讯云',
  国都 = '国都',
}

/**
 * 短信状态：1-待验证 10-已验证 11-发送失败
 */
export enum SMS_STATUS {
  待验证 = 1,
  已验证 = 10,
  发送失败 = 11,
  验证失败 = 12,
}

/**
 * 账户状态 1-正常 11-注销 12-冻结
 */
export enum USER_STATUS {
  正常 = 1,
  注销 = 11,
  冻结 = 12,
}

export enum LOGIN_CLIENT {
  平台端 = 1,
  企业端 = 2,
  小程序端 = 3,
}

/**
 * 日志目标模块
 */
export enum TARGET_TYPE {
  用户 = 'user',
  角色 = 'user_role',
  权限 = 'user_right',
  其他 = 'other',
}

/**
 * 日志操作类型
 */
export enum ACTION_TYPE {
  登录 = 1,
  退出登录 = 2,
  创建登录用户 = 3,
  创建角色 = 4,
  修改角色 = 5,
  分配角色 = 6,
  分配权限 = 7,
  小程序用户注册 = 8,
  修改用户信息 = 9,
  修改密码 = 10,
  创建权限 = 11,
  修改权限 = 12,
  删除权限 = 13,
  删除角色 = 14,
  设置用户状态 = 15,
  其他 = 255,
}
